app/views/items/index.html.haml

= link_to 'New Item', new_item_path
= link_to 'Retrieve items', retrieve_items_path if Item.all.empty?
---
SELECT "items".* FROM "items"