app/controllers/champions_controller.rb

SELECT "champions".* FROM "champions" ORDER BY name DESC
---
  def index
    @champions = Champion.all

SELECT "champions".* FROM "champions" WHERE "champions"."id" = ? ORDER BY name ASC LIMIT 1  [["id", "17"]]
---
  def show
    @champion = Champion.find(params[:id])

SELECT "champions".* FROM "champions" WHERE "champions"."id" = ? ORDER BY name ASC LIMIT 1  [["id", "28"]]
---
  def edit
    @champion = Champion.find(params[:id])

INSERT INTO "champions" ("created_at", "image", "lane", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    debugger

    @champion = Champion.new(champion_params)

    respond_to do |format|
      if @champion.save

SELECT "champions".* FROM "champions" WHERE "champions"."id" = ? ORDER BY name ASC LIMIT 1  [["id", "16"]]
UPDATE "champions" SET "health" = 1925.0, "crit_chance" = '0%', "mana" = 0.0, "health_regen" = 14.75, "speed" = 345.0, "mana_regen" = 0.0, "armor" = 82.4, "range" = 150, "magic_res" = 52.5, "updated_at" = '2013-06-24 01:27:40.713671' WHERE "champions"."id" = 16
---
  def update_stats
    @champion = Champion.find(params[:id])
    base_uri = 'http://leagueoflegends.wikia.com/wiki/'
    #html = Nokogiri::HTML(open("#{base_uri}#{@champion.name}"))

    html = Nokogiri::HTML(open(@champion.source_url)).at_css('div.box-blue').at_css('table').children
    stats = Array.new
    html.each do |e|
      stats << e.children[2].text
      stats << e.children[6].text
    end
    @champion.health = stats[0]
    @champion.crit_chance = stats[1]
    @champion.mana = stats[2]
    @champion.health_regen = stats[3]
    @champion.speed = stats[4]
    @champion.mana_regen = stats[5]
    @champion.armor = stats[6]
    @champion.range = stats[7]
    @champion.magic_res = stats[8]

    @champion.save

SELECT "champions".* FROM "champions" WHERE "champions"."id" = ? ORDER BY name ASC LIMIT 1  [["id", "28"]]
UPDATE "champions" SET "source_url" = 'http://www.mobafire.com/league-of-legends/champion/aatrox-114', "updated_at" = '2013-06-24 01:10:35.311303' WHERE "champions"."id" = 16
---
  def update
    @champion = Champion.find(params[:id])

    respond_to do |format|
      if @champion.update_attributes(champion_params)

SELECT "champions".* FROM "champions" WHERE "champions"."id" = ? ORDER BY name ASC LIMIT 1  [["id", "113"]]
---
  def destroy
    @champion = Champion.find(params[:id])