app/controllers/items_controller.rb

INSERT INTO "items" ("active", "cost", "created_at", "image", "name", "passive", "stats", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
               active: @active,
               cost: img.children.children.at_css('img').get_attribute('data-cost') }

      Item.create(item)